Repository: jeff1978/BattleShips
Catalog: BattleShips/Properties/Resources.*.resx
Languages: mi_nz

# commandsRejectedErrorMessage
source: Too many incorrect placement commands were made. The ship was removed from your fleet.
mi_nz: Rawa i hanga maha whakahau whakanohonga hē. I tangohia te kaipuke i to koutou kaipuke.

# fireErrorMessage
source: The command was not recognised. Ensure that the format is correct eg. 4,5 or 5,2 Enter coordinates to fire your missile...
mi_nz: Kihai i mohio te whakahau. Me whakarite e he tika te hōputu tauira 4,5 ranei 5,2 Tomo taunga ki te ahi i to outou pere...

# gameEndMessage
source: *** This game has ended *** Press any key to exit...
mi_nz: *** Kua mutu tenei kēmu *** Pēhi i tetahi matua ki te putaatu ...

# gameStart
source: Game starting....
mi_nz: Tīmata kēmu....

# getFireCommand
source: {0} enter the coordinates to fire at....
mi_nz: {0} hoatu i te taunga mo to koutou ūnga...

# getGameMode
source: Game mode choices..... 0 - Default game : every player has just one scout and one destroyer ship. 1 - Custom game : choose the the ship types and the quantities needed. Enter 0 or 1:
mi_nz: Kōwhiringa aratau Game ..... 0 - game Taunoa: katoa kaitākaro e tetahi noa matataua me kotahi kaipuke aiwhakangaro. 1 - Ritenga game: whiriwhiri i te nga momo kaipuke me nga rahinga e hiahiatia ana. E tomo 0 ranei 1:

# getModeErrorMessage
source: The mode you entered was not recognised. Try again using a valid number for your game mode.
mi_nz: E kore te kōwhiringa tomo koutou i mohio. Whakamātauria ano te whakamahi i he tokomaha tika mo koutou aratau kēmu.

# getNameErrorMessage
source: Enter a valid name. Name must not be white space or null. Try again.
mi_nz: E tomo te ingoa tika. e kore te tikanga Ingoa e mokowāmā whakakahore ranei. Ngana ano.

# getNumberOfPlayers
source: Enter the number of players for this game (must be two or more):
mi_nz: E tomo te maha o ngā kaitākaro mō tenei kēmu (kia rua neke atu rānei):

# getPlaceErrorMessage
source: The command was not recognised. Ensure that the format is correct eg. 4,5,v or 5,2,h Enter the coordinates and direction for the ship.
mi_nz: Kihai i mohio te whakahau. Me whakarite e he tika te hōputu tauira. 4,5,v ranei 5,2,h tomo te taunga me te aronga mō te kaipuke.

# getPlacementCommand
source: {0}... Enter the coordinates and orientation for your ship e.g. 3,4,h or 7,2,v Hint: All ship positions must lie in the bounds of the sea, and cannot overlap your other ships. Enter the command to place your ship....
mi_nz: E tomo te taunga me te takotoranga mo koutou kaipuke hei tauira 3,4,h ranei 7,2,v Tīwhiri: Me takoto tūranga kaipuke katoa i roto i nga rohe o te moana, a kore e taea te īnaki koutou te tahi atu kaipuke) E tomo te whakahau ki te tuu i to koutou kaipuke ...

# getPlayerName
source: Enter your name. You must submit any value except spaces or null...:
mi_nz: E tomo tou ingoa. Me tuku e koe tetahi uara anake ngā wāhi null ranei ...:

# getPlayerNoErrorMessage
source: Enter a valid number.Two or more players are required for this game.
mi_nz: E tomo te number.Two tika atu kaitākaro ranei E hiahiatia ana hoki tenei kēmu.

# getSeaErrorMessage
source: The sea dimensions given were not valid. Ensure that the format is correct and that the minimum size is 5,5. Enter the sea dimensions.
mi_nz: Kihai i nga āhuatanga moana homai tika. Me whakarite e He tika, me te e te rahi iti ko 5,5 te hōputu. E tomo te āhuatanga moana.

# getSeaSize
source: Sea setup... Note: the sea grid size typed here must be > or = 5 x 5 : Enter the size of the sea, use a comma to separate the x and y dimensions eg. 6,7 Enter the sea size.....
mi_nz: Tatūnga Moana ... Note: Me waiho te rahi mātiti moana pato konei > ranei = 5 x 5: E tomo te rahi o te moana, te whakamahi i te piko ki wehe i te x me te y āhuatanga tauira. 6,7 tomo te rahi te moana .....

# getShipNoErrorMessage
source: The number you entered was not recognised. If ships of this kind are not required then type 0
mi_nz: E kore te tokomaha tomo koutou i mohio. Ki te kaipuke o tenei e kore e atawhai hiahiatia ka pato 0

# getShipTypeNo
source: Please enter the number of {0}s needed:
mi_nz: Tomo koa te maha o {0} e hiahiatia ana te:

# hitMessage
source: Position Hit!!
mi_nz: Poti pakaru!!

# leaveMessage
source: {0} has no ships remaining and has left the game!!
mi_nz: {0} e kore e toe kaipuke me kua mahue te kēmu.

# missMessage
source: Miss!!
mi_nz: Pere ngaro!!

# placementErrorMessage
source: Ship not added because at least one position is already occupied or lies outside the sea boundary. Enter the command to place your ship...
mi_nz: Ship kore tāpiri no te mea kua i te iti rawa kia kotahi te tūranga noho takoto i waho te rohe moana ranei. E tomo te whakahau ki te tuu i to koutou kaipuke ...

# playerSetupIntro
source: New player setup....
mi_nz: Whakaturia ake toa ...

# playerSuffix
source: Player
mi_nz: Toa

# shipTypeDetails
source: Ship to add: {0}, size {1}....
mi_nz: Pōti ki tāpiri: {0}, rahi {1} ....

# sinkMessage
source: Position hit and {0} sunk!!
mi_nz: Kua tūkinotia kaipuke ano me {0} ngaro !!

# winMessage
source: ***** W I N N E R ***** Congratulations {0} You are the winner.
mi_nz: ***** T O A ***** Mihi {0} Ko koe te toa.
